wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_rcc.h
/**
  ******************************************************************************
  * @file    fm33l0xx_rcc.h
  * @author  FM33L0xx Application Team
  * @version V0.1.0
  * @date    12-Jun-2019
  * @brief   This file contains all the functions prototypes for the RCC firmware library.  
  ******************************************************************************
  */
  
/* Define to prevent recursive inclusion -------------------------------------*/

#ifndef __FM33L0XX_RCC_H
#define __FM33L0XX_RCC_H


#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/

#include "FM33L0XX.h"

//------------------------------------------------------------------------------

/* Defines------------------------------------------------------------------*/
#define HXVAR(object, addr)   (*((object *) (addr)))
#define const_rchf_Trim8  	HXVAR( uint32_t, 0x1FFFFD40 )	//RC8M 常温校准值
#define const_rchf_Trim16 	HXVAR( uint32_t, 0x1FFFFD3C )	//RC16M 常温校准值
#define const_rchf_Trim24 	HXVAR( uint32_t, 0x1FFFFD38 )	//RC24M 常温校准值
   
#define RSTKEY0  ((uint32_t)0x13579BDF)  //使能外设复位功能key
#define RSTKEY1  ((uint32_t)0x00000000)  //关闭外设复位功能key
/* Exported constants --------------------------------------------------------*/


/* Exported types ------------------------------------------------------------*/
typedef struct
{
	uint32_t			FSEL;		/*!<RCHF频率  */
	FunState			RCHFEN;			/*!<RCHF使能控制  */
}RCC_RCHF_InitTypeDef;

typedef struct
{            
  uint32_t			PLLDB;		/*!<PLL倍频比最大1023,pll倍频数 = PLLDB + 1  */
	uint32_t      REFPRSC;		/* PLL参考时钟预分频 */
	uint32_t			PLLOSEL;	/*!<PLL输出选择，当需要输出超过1024倍时开启两倍输出模式  */
	uint32_t			PLLINSEL;	/*!<PLL输入源选择  */
	FunState			PLLEN;		/*!<PLL使能控制  */
}RCC_PLL_InitTypeDef;

typedef struct
{
	FunState			LPM_RCLP_OFF;			/*!<休眠模式下RCLP控制寄存器  */
}RCC_RCLP_InitTypeDef;

typedef struct
{
    uint32_t		SYSCLKSEL;		/*!<系统时钟选择，从休眠状态唤醒后会自动恢复为RCHF8M  */
	uint32_t			STCLKSEL;		/* CPU内核systick工作时钟选择  */
	uint32_t			AHBPRES;		/*!<AHB时钟分频选择  */
	uint32_t			APBPRES;		/*!<APB时钟分频选择  */
	FunState			SLP_ENEXTI;		/*!<Sleep/DeepSleep模式下EXTI采样设置  */
	FunState			LSCATS;	/* LSCLK自动切换使能  */	
}RCC_SYSCLK_InitTypeDef;

typedef struct
{
	uint32_t			RC4MPSC;		/*!<RC4M频率  */
	FunState			RC4MEN;			/*!<RC4M使能控制  */
}RCC_RC4M_InitTypeDef;

typedef struct
{
  uint32_t SYSCLK_Frequency;		/*!<  SYSCLK clock frequency expressed in Hz */
  uint32_t AHBCLK_Frequency;		/*!<  AHB clock frequency expressed in Hz  */
  uint32_t APBCLK_Frequency;		/*!<  APB clock frequency expressed in Hz  */
  uint32_t RCHF_Frequency;			/*!<  RCHF clock frequency expressed in Hz   */
  uint32_t PLL_Frequency;			/*!<  PLL clock frequency expressed in Hz   */
	uint32_t RC4M_Frequency;   /*!<  RC4M clock frequency expressed in Hz   */
}RCC_ClocksType;

#define	RCC_LKP_CR_RST_EN_Pos	1
#define	RCC_LKP_CR_RST_EN_Msk	(0x1U << RCC_LKP_CR_RST_EN_Pos)
	/* 0：屏蔽CPU LOCKUP复位 */
	/* 1：使能CPU LOCKUP复位 */

#define	RCC_SOFTRST_SOFTRST_Pos	0
#define	RCC_SOFTRST_SOFTRST_Msk	(0xffffffffU << RCC_SOFTRST_SOFTRST_Pos)

#define	RCC_RSTFR_NRSTN_FLAG_Pos	11
#define	RCC_RSTFR_NRSTN_FLAG_Msk	(0x1U << RCC_RSTFR_NRSTN_FLAG_Pos)

#define	RCC_RSTFR_TESTN_FLAG_Pos	10
#define	RCC_RSTFR_TESTN_FLAG_Msk	(0x1U << RCC_RSTFR_TESTN_FLAG_Pos)

#define	RCC_RSTFR_PORN_FLAG_Pos	9
#define	RCC_RSTFR_PORN_FLAG_Msk	(0x1U << RCC_RSTFR_PORN_FLAG_Pos)

#define	RCC_RSTFR_PDRN_FLAG_Pos	8
#define	RCC_RSTFR_PDRN_FLAG_Msk	(0x1U << RCC_RSTFR_PDRN_FLAG_Pos)

#define	RCC_RSTFR_SOFTN_FLAG_Pos	5
#define	RCC_RSTFR_SOFTN_FLAG_Msk	(0x1U << RCC_RSTFR_SOFTN_FLAG_Pos)

#define	RCC_RSTFR_IWDTN_FLAG_Pos	4
#define	RCC_RSTFR_IWDTN_FLAG_Msk	(0x1U << RCC_RSTFR_IWDTN_FLAG_Pos)

#define	RCC_RSTFR_WWDTN_FLAG_Pos	2
#define	RCC_RSTFR_WWDTN_FLAG_Msk	(0x1U << RCC_RSTFR_WWDTN_FLAG_Pos)

#define	RCC_RSTFR_LKUPN_FLAG_Pos	1
#define	RCC_RSTFR_LKUPN_FLAG_Msk	(0x1U << RCC_RSTFR_LKUPN_FLAG_Pos)

#define	RCC_RSTFR_NVICN_FLAG_Pos	0
#define	RCC_RSTFR_NVICN_FLAG_Msk	(0x1U << RCC_RSTFR_NVICN_FLAG_Pos)

#define	RCC_SYSCLK_CR_LSCATS_Pos	27	/* LSCLK自动切换使能 */
#define	RCC_SYSCLK_CR_LSCATS_Msk	(0x1U << RCC_SYSCLK_CR_LSCATS_Pos)
	/* 0：当检测到XTLF异常停振时，不会自动将LSCLK切换到RCLP，软件可以通过写XTLFCR.XTLF_BKSW寄存器手动切换到RCLP */
	/* 1：当检测到XTLF异常停振时，自动使能RCLP并将LSCLK切换到RCLP */

#define	RCC_SYSCLK_CR_SLP_ENEXTI_Pos	25	/* Sleep/DeepSleep模式下EXTI采样设置 */
#define	RCC_SYSCLK_CR_SLP_ENEXTI_Msk	(0x1U << RCC_SYSCLK_CR_SLP_ENEXTI_Pos)
	/* 0：Sleep/DeepSleep模式下禁止外部引脚中断采样 */
	/* 1：Sleep/DeepSleep模式下使能外部引脚中断采样 */

#define	RCC_SYSCLK_CR_APBPRES_Pos	16	/* APB时钟分频选择 */
#define	RCC_SYSCLK_CR_APBPRES_Msk	(0x7U << RCC_SYSCLK_CR_APBPRES_Pos)
#define	RCC_SYSCLK_CR_APBPRES_DIV1	(0x0U << RCC_SYSCLK_CR_APBPRES_Pos)	/* 0XX:不分频 */
#define	RCC_SYSCLK_CR_APBPRES_DIV2	(0x4U << RCC_SYSCLK_CR_APBPRES_Pos)	/* 100：2分频 */
#define	RCC_SYSCLK_CR_APBPRES_DIV4	(0x5U << RCC_SYSCLK_CR_APBPRES_Pos)	/* 101：4分频 */
#define	RCC_SYSCLK_CR_APBPRES_DIV8	(0x6U << RCC_SYSCLK_CR_APBPRES_Pos)	/* 110：8分频 */
#define	RCC_SYSCLK_CR_APBPRES_DIV16	(0x7U << RCC_SYSCLK_CR_APBPRES_Pos)	/* 111：16分频 */

#define	RCC_SYSCLK_CR_AHBPRES_Pos	8	/* AHB时钟分频选择 */
#define	RCC_SYSCLK_CR_AHBPRES_Msk	(0x7U << RCC_SYSCLK_CR_AHBPRES_Pos)
#define	RCC_SYSCLK_CR_AHBPRES_DIV1	(0x0U << RCC_SYSCLK_CR_AHBPRES_Pos)	/* 0XX:不分频 */
#define	RCC_SYSCLK_CR_AHBPRES_DIV2	(0x4U << RCC_SYSCLK_CR_AHBPRES_Pos)	/* 100：2分频 */
#define	RCC_SYSCLK_CR_AHBPRES_DIV4	(0x5U << RCC_SYSCLK_CR_AHBPRES_Pos)	/* 101：4分频 */
#define	RCC_SYSCLK_CR_AHBPRES_DIV8	(0x6U << RCC_SYSCLK_CR_AHBPRES_Pos)	/* 110：8分频 */
#define	RCC_SYSCLK_CR_AHBPRES_DIV16	(0x7U << RCC_SYSCLK_CR_AHBPRES_Pos)	/* 111：16分频 */

#define	RCC_SYSCLK_CR_STCLKSEL_Pos	6	/* CPU内核systick工作时钟选择 */
#define	RCC_SYSCLK_CR_STCLKSEL_Msk	(0x3U << RCC_SYSCLK_CR_STCLKSEL_Pos)
#define	RCC_SYSCLK_CR_STCLKSEL_SCLK	(0x0U << RCC_SYSCLK_CR_STCLKSEL_Pos)	/* 00：SCLK */
#define	RCC_SYSCLK_CR_STCLKSEL_LSCLK	(0x1U << RCC_SYSCLK_CR_STCLKSEL_Pos)	/* 01：LSCLK */
#define	RCC_SYSCLK_CR_STCLKSEL_RC4M	(0x2U << RCC_SYSCLK_CR_STCLKSEL_Pos)	/* 10：RC4M */
#define	RCC_SYSCLK_CR_STCLKSEL_SYSCLK	(0x3U << RCC_SYSCLK_CR_STCLKSEL_Pos)	/* 11：SYSCLK */

#define	RCC_SYSCLK_CR_SYSCLKSEL_Pos	0	/* 系统时钟源选择 */
#define	RCC_SYSCLK_CR_SYSCLKSEL_Msk	(0x7U << RCC_SYSCLK_CR_SYSCLKSEL_Pos)
#define	RCC_SYSCLK_CR_SYSCLKSEL_RCHF	(0x0U << RCC_SYSCLK_CR_SYSCLKSEL_Pos)	/* 000：RCHF */
#define	RCC_SYSCLK_CR_SYSCLKSEL_XTHF	(0x1U << RCC_SYSCLK_CR_SYSCLKSEL_Pos)	/* 001：XTHF */
#define	RCC_SYSCLK_CR_SYSCLKSEL_PLL	(0x2U << RCC_SYSCLK_CR_SYSCLKSEL_Pos)	/* 010：PLL */
#define	RCC_SYSCLK_CR_SYSCLKSEL_RC4MPSC	(0x4U << RCC_SYSCLK_CR_SYSCLKSEL_Pos)	/* 100：RC4MPSC */
#define	RCC_SYSCLK_CR_SYSCLKSEL_LSCK	(0x5U << RCC_SYSCLK_CR_SYSCLKSEL_Pos)	/* 101,110,111：LSCLK */

#define	RCC_RCHF_CR_FSEL_Pos	16	/* RCHF频率选择寄存器 */
#define	RCC_RCHF_CR_FSEL_Msk	(0xfU << RCC_RCHF_CR_FSEL_Pos)
#define	RCC_RCHF_CR_FSEL_8MHZ	(0x0U << RCC_RCHF_CR_FSEL_Pos)	/* 0000：8MHz */
#define	RCC_RCHF_CR_FSEL_16MHZ	(0x1U << RCC_RCHF_CR_FSEL_Pos)	/* 0001：16MHz */
#define	RCC_RCHF_CR_FSEL_24MHZ	(0x2U << RCC_RCHF_CR_FSEL_Pos)	/* 0010：24MHz */

#define	RCC_RCHF_CR_EN_Pos	0	/* RCHF使能寄存器 */
#define	RCC_RCHF_CR_EN_Msk	(0x1U << RCC_RCHF_CR_EN_Pos)
	/* 0：关闭RCHF */
	/* 1：使能RCHF */

#define	RCC_RC4M_TR_TRIM_Pos	0	/* RC4M频率调校寄存器 */
#define	RCC_RC4M_TR_TRIM_Msk	(0x7fU << RCC_RC4M_TR_TRIM_Pos)

