wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_rcc.h
#define	RCC_PLL_CR_DB_Pos	16	/* PLL倍频比 */
#define	RCC_PLL_CR_DB_Msk	(0x7fU << RCC_PLL_CR_DB_Pos)

#define	RCC_PLL_CR_LOCKED_Pos	7	/* PLL锁定标志 */
#define	RCC_PLL_CR_LOCKED_Msk	(0x1U << RCC_PLL_CR_LOCKED_Pos)

#define	RCC_PLL_CR_REFPRSC_Pos	4	/* PLL参考时钟预分频（目标是产生1MHz参考时钟给PLL） */
#define	RCC_PLL_CR_REFPRSC_Msk	(0x7U << RCC_PLL_CR_REFPRSC_Pos)
#define	RCC_PLL_CR_REFPRSC_DIV1	(0x0U << RCC_PLL_CR_REFPRSC_Pos)	/* 000：不分频 */
#define	RCC_PLL_CR_REFPRSC_DIV2	(0x1U << RCC_PLL_CR_REFPRSC_Pos)	/* 001：2分频 */
#define	RCC_PLL_CR_REFPRSC_DIV4	(0x2U << RCC_PLL_CR_REFPRSC_Pos)	/* 010：4分频 */
#define	RCC_PLL_CR_REFPRSC_DIV8	(0x3U << RCC_PLL_CR_REFPRSC_Pos)	/* 011：8分频 */
#define	RCC_PLL_CR_REFPRSC_DIV12	(0x4U << RCC_PLL_CR_REFPRSC_Pos)	/* 100：12分频 */
#define	RCC_PLL_CR_REFPRSC_DIV16	(0x5U << RCC_PLL_CR_REFPRSC_Pos)	/* 101：16分频 */
#define	RCC_PLL_CR_REFPRSC_DIV24	(0x6U << RCC_PLL_CR_REFPRSC_Pos)	/* 110：24分频 */
#define	RCC_PLL_CR_REFPRSC_DIV32	(0x7U << RCC_PLL_CR_REFPRSC_Pos)	/* 111：32分频 */

#define	RCC_PLL_CR_OSEL_Pos	3	/* PLL输出选择寄存器 */
#define	RCC_PLL_CR_OSEL_Msk	(0x1U << RCC_PLL_CR_OSEL_Pos)
#define	RCC_PLL_CR_OSEL_MUL1	(0x0U << RCC_PLL_CR_OSEL_Pos)	/* 0：选择PLL一倍输出作为数字电路内的PLL时钟 */
#define	RCC_PLL_CR_OSEL_MUL2	(0x1U << RCC_PLL_CR_OSEL_Pos)	/* 1：选择PLL两倍输出作为数字电路内的PLL时钟 */

#define	RCC_PLL_CR_INSEL_Pos	1	/* PLL输入选择寄存器 */
#define	RCC_PLL_CR_INSEL_Msk	(0x1U << RCC_PLL_CR_INSEL_Pos)
#define	RCC_PLL_CR_INSEL_RCHF	(0x0U << RCC_PLL_CR_INSEL_Pos)	/* 0：RCHF */
#define	RCC_PLL_CR_INSEL_XTHF	(0x1U << RCC_PLL_CR_INSEL_Pos)	/* 1：XTHF */

#define	RCC_PLL_CR_EN_Pos	0	/* PLL使能寄存器 */
#define	RCC_PLL_CR_EN_Msk	(0x1U << RCC_PLL_CR_EN_Pos)
	/* 0：关闭PLL */
	/* 1：使能PLL */

#define	RCC_RCLP_CR_OFF_EN_Pos	1	/* RCLP使能标志信号 */
#define	RCC_RCLP_CR_OFF_EN_Msk	(0x1U << RCC_RCLP_CR_OFF_EN_Pos)

#define	RCC_RCLP_CR_LPM_RCLP_OFF_Pos	0	/* 休眠模式下RCLP控制寄存器 */
#define	RCC_RCLP_CR_LPM_RCLP_OFF_Msk	(0x1U << RCC_RCLP_CR_LPM_RCLP_OFF_Pos)
#define	RCC_RCLP_CR_LPM_RCLP_OFF_OPEN	(0x0U << RCC_RCLP_CR_LPM_RCLP_OFF_Pos)	/* 0：休眠模式下RCLP开启 */
#define	RCC_RCLP_CR_LPM_RCLP_OFF_CLOSE	(0x1U << RCC_RCLP_CR_LPM_RCLP_OFF_Pos)	/* 1：休眠模式下RCLP关闭 */

#define	RCC_RCLP_TR_TRIM_Pos	0	/* RCLP调校值寄存器 */
#define	RCC_RCLP_TR_TRIM_Msk	(0xffU << RCC_RCLP_TR_TRIM_Pos)

#define	RCC_XTLF_CR_BKSW_Pos	16	/* XTLF备份时钟手动切换寄存器 */
#define	RCC_XTLF_CR_BKSW_Msk	(0xffU << RCC_XTLF_CR_BKSW_Pos)

#define	RCC_XTLF_CR_EN_Pos	8	/* XTLF使能寄存器 */
#define	RCC_XTLF_CR_EN_Msk	(0xfU << RCC_XTLF_CR_EN_Pos)
#define	RCC_XTLF_CR_EN_DISABLE	(0xaU << RCC_XTLF_CR_EN_Pos)	/* 1010：关闭XTLF和FDET */
#define	RCC_XTLF_CR_EN_ENABLE	(0x5U << RCC_XTLF_CR_EN_Pos)	/* 其他：使能XTLF和FDET */

#define	RCC_XTLF_CR_IPW_Pos	0	/* XTLF工作电流选择 */
#define	RCC_XTLF_CR_IPW_Msk	(0x7U << RCC_XTLF_CR_IPW_Pos)
#define	RCC_XTLF_CR_IPW_450NA	(0x0U << RCC_XTLF_CR_IPW_Pos)
#define	RCC_XTLF_CR_IPW_400NA	(0x1U << RCC_XTLF_CR_IPW_Pos)
#define	RCC_XTLF_CR_IPW_350NA	(0x2U << RCC_XTLF_CR_IPW_Pos)
#define	RCC_XTLF_CR_IPW_300NA	(0x3U << RCC_XTLF_CR_IPW_Pos)
#define	RCC_XTLF_CR_IPW_250NA	(0x4U << RCC_XTLF_CR_IPW_Pos)
#define	RCC_XTLF_CR_IPW_200NA	(0x5U << RCC_XTLF_CR_IPW_Pos)
#define	RCC_XTLF_CR_IPW_150NA	(0x6U << RCC_XTLF_CR_IPW_Pos)
#define	RCC_XTLF_CR_IPW_100NA	(0x7U << RCC_XTLF_CR_IPW_Pos)

#define	RCC_PCLK_CR1_DCU_PCE_Pos	31
#define	RCC_PCLK_CR1_DCU_PCE_Msk	(0x1U << RCC_PCLK_CR1_DCU_PCE_Pos)
	/* DCU总线时钟使能，高使能 */

#define	RCC_PCLK_CR1_BEEP_PCE_Pos	16
#define	RCC_PCLK_CR1_BEEP_PCE_Msk	(0x1U << RCC_PCLK_CR1_BEEP_PCE_Pos)
	/* BEEPER总线时钟使能，高使能 */

#define	RCC_PCLK_CR1_PAD_PCE_Pos	7
#define	RCC_PCLK_CR1_PAD_PCE_Msk	(0x1U << RCC_PCLK_CR1_PAD_PCE_Pos)
	/* PADCFG总线时钟使能，高使能 */

#define	RCC_PCLK_CR1_ANAC_PCE_Pos	6
#define	RCC_PCLK_CR1_ANAC_PCE_Msk	(0x1U << RCC_PCLK_CR1_ANAC_PCE_Pos)
	/* ANAC总线时钟使能，高使能  */

#define	RCC_PCLK_CR1_IWDT_PCE_Pos	5
#define	RCC_PCLK_CR1_IWDT_PCE_Msk	(0x1U << RCC_PCLK_CR1_IWDT_PCE_Pos)
	/* IWDT总线时钟使能，高使能 */

#define	RCC_PCLK_CR1_SCU_PCE_Pos	4
#define	RCC_PCLK_CR1_SCU_PCE_Msk	(0x1U << RCC_PCLK_CR1_SCU_PCE_Pos)
	/* SCU总线时钟使能，高使能 */

#define	RCC_PCLK_CR1_PMU_PCE_Pos	3
#define	RCC_PCLK_CR1_PMU_PCE_Msk	(0x1U << RCC_PCLK_CR1_PMU_PCE_Pos)
	/* PMU总线时钟使能，高使能 */

#define	RCC_PCLK_CR1_RTC_PCE_Pos	2
#define	RCC_PCLK_CR1_RTC_PCE_Msk	(0x1U << RCC_PCLK_CR1_RTC_PCE_Pos)
	/* RTC总线时钟使能，高使能 */

#define	RCC_PCLK_CR1_LPT_PCE_Pos	0
#define	RCC_PCLK_CR1_LPT_PCE_Msk	(0x1U << RCC_PCLK_CR1_LPT_PCE_Pos)
	/* LPTIM32总线时钟使能，高使能 */

#define	RCC_PCLK_CR2_ADC_PCE_Pos	8
#define	RCC_PCLK_CR2_ADC_PCE_Msk	(0x1U << RCC_PCLK_CR2_ADC_PCE_Pos)
	/* ADC总线时钟使能，高使能 */

#define	RCC_PCLK_CR2_WWDT_PCE_Pos	7
#define	RCC_PCLK_CR2_WWDT_PCE_Msk	(0x1U << RCC_PCLK_CR2_WWDT_PCE_Pos)
	/* WWDT总线时钟使能，高使能 */

#define	RCC_PCLK_CR2_RAMBIST_PCE_Pos	6
#define	RCC_PCLK_CR2_RAMBIST_PCE_Msk	(0x1U << RCC_PCLK_CR2_RAMBIST_PCE_Pos)
	/* RAMBIST总线时钟使能，高使能 */

#define	RCC_PCLK_CR2_FLS_PCE_Pos	5
#define	RCC_PCLK_CR2_FLS_PCE_Msk	(0x1U << RCC_PCLK_CR2_FLS_PCE_Pos)
	/* Flash擦写控制器 总线时钟使能，高使能*/
	
#define	RCC_PCLK_CR2_DMA_PCE_Pos	4
#define	RCC_PCLK_CR2_DMA_PCE_Msk	(0x1U << RCC_PCLK_CR2_DMA_PCE_Pos)
	/* DMA总线时钟使能，高使能 */

#define	RCC_PCLK_CR2_LCD_PCE_Pos	3
#define	RCC_PCLK_CR2_LCD_PCE_Msk	(0x1U << RCC_PCLK_CR2_LCD_PCE_Pos)
	/* LCD总线时钟使能，高使能 */

#define	RCC_PCLK_CR2_AES_PCE_Pos	2
#define	RCC_PCLK_CR2_AES_PCE_Msk	(0x1U << RCC_PCLK_CR2_AES_PCE_Pos)
	/* AES总线时钟使能，高使能 */

#define	RCC_PCLK_CR2_RNG_PCE_Pos	1
#define	RCC_PCLK_CR2_RNG_PCE_Msk	(0x1U << RCC_PCLK_CR2_RNG_PCE_Pos)
	/* RNG总线时钟使能，高使能 */

#define	RCC_PCLK_CR2_CRC_PCE_Pos	0
#define	RCC_PCLK_CR2_CRC_PCE_Msk	(0x1U << RCC_PCLK_CR2_CRC_PCE_Pos)
	/* CRC总线时钟使能，高使能 */

#define	RCC_PCLK_CR3_I2C_PCE_Pos	24
#define	RCC_PCLK_CR3_I2C_PCE_Msk	(0x1U << RCC_PCLK_CR3_I2C_PCE_Pos)
	/* I2C总线时钟使能，高有效 */

#define	RCC_PCLK_CR3_LPUART1_PCE_Pos	18
#define	RCC_PCLK_CR3_LPUART1_PCE_Msk	(0x1U << RCC_PCLK_CR3_LPUART1_PCE_Pos)
	/* LPUART1总线时钟使能，高有效 */

#define	RCC_PCLK_CR3_U7816_PCE_Pos	16
#define	RCC_PCLK_CR3_U7816_PCE_Msk	(0x1U << RCC_PCLK_CR3_U7816_PCE_Pos)
	/* 7816总线时钟使能，高有效 */

#define	RCC_PCLK_CR3_LPUART0_PCE_Pos	15
#define	RCC_PCLK_CR3_LPUART0_PCE_Msk	(0x1U << RCC_PCLK_CR3_LPUART0_PCE_Pos)
	/* LPUART总线时钟使能，高有效 */

#define	RCC_PCLK_CR3_UCIR_PCE_Pos	14
#define	RCC_PCLK_CR3_UCIR_PCE_Msk	(0x1U << RCC_PCLK_CR3_UCIR_PCE_Pos)
	/* UART红外调制工作时钟使能，高有效 */

#define	RCC_PCLK_CR3_UART5_PCE_Pos	13
#define	RCC_PCLK_CR3_UART5_PCE_Msk	(0x1U << RCC_PCLK_CR3_UART5_PCE_Pos)
	/* UART5总线时钟使能，高有效 */

#define	RCC_PCLK_CR3_UART4_PCE_Pos	12
#define	RCC_PCLK_CR3_UART4_PCE_Msk	(0x1U << RCC_PCLK_CR3_UART4_PCE_Pos)
	/* UART4总线时钟使能，高有效 */

