wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_rcc.h
#define	RCC_PCLK_CR3_UART1_PCE_Pos	9
#define	RCC_PCLK_CR3_UART1_PCE_Msk	(0x1U << RCC_PCLK_CR3_UART1_PCE_Pos)
	/* UART1总线时钟使能，高有效 */

#define	RCC_PCLK_CR3_UART0_PCE_Pos	8
#define	RCC_PCLK_CR3_UART0_PCE_Msk	(0x1U << RCC_PCLK_CR3_UART0_PCE_Pos)
	/* UART0总线时钟使能，高有效 */

#define	RCC_PCLK_CR3_SPI2_PCE_Pos	1
#define	RCC_PCLK_CR3_SPI2_PCE_Msk	(0x1U << RCC_PCLK_CR3_SPI2_PCE_Pos)
	/* SPI2总线时钟使能，高有效 */

#define	RCC_PCLK_CR3_SPI1_PCE_Pos	0
#define	RCC_PCLK_CR3_SPI1_PCE_Msk	(0x1U << RCC_PCLK_CR3_SPI1_PCE_Pos)
	/* SPI1总线时钟使能，高有效 */

#define	RCC_PCLK_CR4_AT_PCE_Pos	4
#define	RCC_PCLK_CR4_AT_PCE_Msk	(0x1U << RCC_PCLK_CR4_AT_PCE_Pos)
	/* 高级定时器总线时钟使能，高有效 */

#define	RCC_PCLK_CR4_GT1_PCE_Pos	3
#define	RCC_PCLK_CR4_GT1_PCE_Msk	(0x1U << RCC_PCLK_CR4_GT1_PCE_Pos)
	/* 通用定时器1总线时钟使能，高有效 */

#define	RCC_PCLK_CR4_GT0_PCE_Pos	2
#define	RCC_PCLK_CR4_GT0_PCE_Msk	(0x1U << RCC_PCLK_CR4_GT0_PCE_Pos)
	/* 通用定时器0总线时钟使能，高有效 */

#define	RCC_PCLK_CR4_BT_PCE_Pos	0
#define	RCC_PCLK_CR4_BT_PCE_Msk	(0x1U << RCC_PCLK_CR4_BT_PCE_Pos)
	/* 基本定时器0总线时钟使能，高有效 */

#define	RCC_AHBM_CR_MPRIL_Pos	0	/* AHB Master优先级配置寄存器 */
#define	RCC_AHBM_CR_MPRIL_Msk	(0x1U << RCC_AHBM_CR_MPRIL_Pos)
#define	RCC_AHBM_CR_MPRIL_DMA	(0x0U << RCC_AHBM_CR_MPRIL_Pos)
#define	RCC_AHBM_CR_MPRIL_CPU	(0x1U << RCC_AHBM_CR_MPRIL_Pos)

#define	RCC_PRST_EN_PERHRSTEN_Pos	0	/* 外设模块复位使能 */
#define	RCC_PRST_EN_PERHRSTEN_Msk	(0xffffffffU << RCC_PRST_EN_PERHRSTEN_Pos)

#define	RCC_AHBRST_CR_DMARST_Pos	0	/* DMA模块复位 */
#define	RCC_AHBRST_CR_DMARST_Msk	(0x1U << RCC_AHBRST_CR_DMARST_Pos)
#define	RCC_AHBRST_CR_DMARST_NORST	(0x0U << RCC_AHBRST_CR_DMARST_Pos)	/* 0：不复位 */
#define	RCC_AHBRST_CR_DMARST_RST	(0x1U << RCC_AHBRST_CR_DMARST_Pos)	/* 1：复位 */

#define	RCC_APBRST_CR1_UART5RST_Pos	31	/* UART5模块复位 */
#define	RCC_APBRST_CR1_UART5RST_Msk	(0x1U << RCC_APBRST_CR1_UART5RST_Pos)
#define	RCC_APBRST_CR1_UART5RST_NORST	(0x0U << RCC_APBRST_CR1_UART5RST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR1_UART5RST_RST	(0x1U << RCC_APBRST_CR1_UART5RST_Pos)	/* 1：复位 */

#define	RCC_APBRST_CR1_UART4RST_Pos	30	/* UART4模块复位 */
#define	RCC_APBRST_CR1_UART4RST_Msk	(0x1U << RCC_APBRST_CR1_UART4RST_Pos)
#define	RCC_APBRST_CR1_UART4RST_NORST	(0x0U << RCC_APBRST_CR1_UART4RST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR1_UART4RST_RST	(0x1U << RCC_APBRST_CR1_UART4RST_Pos)	/* 1：复位 */

#define	RCC_APBRST_CR1_GT1RST_Pos	25	/* GPTIM1模块复位 */
#define	RCC_APBRST_CR1_GT1RST_Msk	(0x1U << RCC_APBRST_CR1_GT1RST_Pos)
#define	RCC_APBRST_CR1_GT1RST_NORST	(0x0U << RCC_APBRST_CR1_GT1RST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR1_GT1RST_RST	(0x1U << RCC_APBRST_CR1_GT1RST_Pos)	/* 1：复位 */

#define	RCC_APBRST_CR1_GT0RST_Pos	24	/* GPTIM0模块复位 */
#define	RCC_APBRST_CR1_GT0RST_Msk	(0x1U << RCC_APBRST_CR1_GT0RST_Pos)
#define	RCC_APBRST_CR1_GT0RST_NORST	(0x0U << RCC_APBRST_CR1_GT0RST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR1_GT0RST_RST	(0x1U << RCC_APBRST_CR1_GT0RST_Pos)	/* 1：复位 */

#define	RCC_APBRST_CR1_LCDRST_Pos	16	/* LCD模块复位 */
#define	RCC_APBRST_CR1_LCDRST_Msk	(0x1U << RCC_APBRST_CR1_LCDRST_Pos)
#define	RCC_APBRST_CR1_LCDRST_NORST	(0x0U << RCC_APBRST_CR1_LCDRST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR1_LCDRST_RST	(0x1U << RCC_APBRST_CR1_LCDRST_Pos)	/* 1：复位 */

#define	RCC_APBRST_CR1_U7816RST_Pos	14	/* U7816模块复位 */
#define	RCC_APBRST_CR1_U7816RST_Msk	(0x1U << RCC_APBRST_CR1_U7816RST_Pos)
#define	RCC_APBRST_CR1_U7816RST_NORST	(0x0U << RCC_APBRST_CR1_U7816RST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR1_U7816RST_RST	(0x1U << RCC_APBRST_CR1_U7816RST_Pos)	/* 1：复位 */

#define	RCC_APBRST_CR1_SPI2RST_Pos	10	/* SPI2模块复位 */
#define	RCC_APBRST_CR1_SPI2RST_Msk	(0x1U << RCC_APBRST_CR1_SPI2RST_Pos)
#define	RCC_APBRST_CR1_SPI2RST_NORST	(0x0U << RCC_APBRST_CR1_SPI2RST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR1_SPI2RST_RST	(0x1U << RCC_APBRST_CR1_SPI2RST_Pos)	/* 1：复位 */

#define	RCC_APBRST_CR1_LPUART0RST_Pos	6	/* LPUART0模块复位 */
#define	RCC_APBRST_CR1_LPUART0RST_Msk	(0x1U << RCC_APBRST_CR1_LPUART0RST_Pos)
#define	RCC_APBRST_CR1_LPUART0RST_NORST	(0x0U << RCC_APBRST_CR1_LPUART0RST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR1_LPUART0RST_RST	(0x1U << RCC_APBRST_CR1_LPUART0RST_Pos)	/* 1：复位 */

#define	RCC_APBRST_CR1_I2CRST_Pos	3	/* I2C模块复位 */
#define	RCC_APBRST_CR1_I2CRST_Msk	(0x1U << RCC_APBRST_CR1_I2CRST_Pos)
#define	RCC_APBRST_CR1_I2CRST_NORST	(0x0U << RCC_APBRST_CR1_I2CRST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR1_I2CRST_RST	(0x1U << RCC_APBRST_CR1_I2CRST_Pos)	/* 1：复位 */

#define	RCC_APBRST_CR1_LPT32RST_Pos	0	/* LPTIM32模块复位 */
#define	RCC_APBRST_CR1_LPT32RST_Msk	(0x1U << RCC_APBRST_CR1_LPT32RST_Pos)
#define	RCC_APBRST_CR1_LPT32RST_NORST	(0x0U << RCC_APBRST_CR1_LPT32RST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR1_LPT32RST_RST	(0x1U << RCC_APBRST_CR1_LPT32RST_Pos)	/* 1：复位 */

#define	RCC_APBRST_CR2_ATRST_Pos	31	/* ATIM模块复位 */
#define	RCC_APBRST_CR2_ATRST_Msk	(0x1U << RCC_APBRST_CR2_ATRST_Pos)
#define	RCC_APBRST_CR2_ATRST_NORST	(0x0U << RCC_APBRST_CR2_ATRST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR2_ATRST_RST	(0x1U << RCC_APBRST_CR2_ATRST_Pos)	/* 1：复位 */

#define	RCC_APBRST_CR2_BTRST_Pos	28	/* BSTIM模块复位 */
#define	RCC_APBRST_CR2_BTRST_Msk	(0x1U << RCC_APBRST_CR2_BTRST_Pos)
#define	RCC_APBRST_CR2_BTRST_NORST	(0x0U << RCC_APBRST_CR2_BTRST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR2_BTRST_RST	(0x1U << RCC_APBRST_CR2_BTRST_Pos)	/* 1：复位 */

#define	RCC_APBRST_CR2_ADCCRST_Pos	24	/* ADC控制器复位 */
#define	RCC_APBRST_CR2_ADCCRST_Msk	(0x1U << RCC_APBRST_CR2_ADCCRST_Pos)
#define	RCC_APBRST_CR2_ADCCRST_NORST	(0x0U << RCC_APBRST_CR2_ADCCRST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR2_ADCCRST_RST	(0x1U << RCC_APBRST_CR2_ADCCRST_Pos)	/* 1：复位 */

#define	RCC_APBRST_CR2_ADCRST_Pos	23	/* ADC模块复位 */
#define	RCC_APBRST_CR2_ADCRST_Msk	(0x1U << RCC_APBRST_CR2_ADCRST_Pos)
#define	RCC_APBRST_CR2_ADCRST_NORST	(0x0U << RCC_APBRST_CR2_ADCRST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR2_ADCRST_RST	(0x1U << RCC_APBRST_CR2_ADCRST_Pos)	/* 1：复位 */

#define	RCC_APBRST_CR2_OPARST_Pos	22	/* 运放模块复位 */
#define	RCC_APBRST_CR2_OPARST_Msk	(0x1U << RCC_APBRST_CR2_OPARST_Pos)
#define	RCC_APBRST_CR2_OPARST_NORST	(0x0U << RCC_APBRST_CR2_OPARST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR2_OPARST_RST	(0x1U << RCC_APBRST_CR2_OPARST_Pos)	/* 1：复位 */

#define	RCC_APBRST_CR2_AESRST_Pos	18	/* AES模块复位 */
#define	RCC_APBRST_CR2_AESRST_Msk	(0x1U << RCC_APBRST_CR2_AESRST_Pos)
#define	RCC_APBRST_CR2_AESRST_NORST	(0x0U << RCC_APBRST_CR2_AESRST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR2_AESRST_RST	(0x1U << RCC_APBRST_CR2_AESRST_Pos)	/* 1：复位 */

#define	RCC_APBRST_CR2_CRCRST_Pos	17	/* CRC模块复位 */
#define	RCC_APBRST_CR2_CRCRST_Msk	(0x1U << RCC_APBRST_CR2_CRCRST_Pos)
#define	RCC_APBRST_CR2_CRCRST_NORST	(0x0U << RCC_APBRST_CR2_CRCRST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR2_CRCRST_RST	(0x1U << RCC_APBRST_CR2_CRCRST_Pos)	/* 1：复位 */

#define	RCC_APBRST_CR2_RNGRST_Pos	16	/* RNG模块复位 */
#define	RCC_APBRST_CR2_RNGRST_Msk	(0x1U << RCC_APBRST_CR2_RNGRST_Pos)
#define	RCC_APBRST_CR2_RNGRST_NORST	(0x0U << RCC_APBRST_CR2_RNGRST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR2_RNGRST_RST	(0x1U << RCC_APBRST_CR2_RNGRST_Pos)	/* 1：复位 */

#define	RCC_APBRST_CR2_UART1RST_Pos	12	/* UART1模块复位 */
#define	RCC_APBRST_CR2_UART1RST_Msk	(0x1U << RCC_APBRST_CR2_UART1RST_Pos)
#define	RCC_APBRST_CR2_UART1RST_NORST	(0x0U << RCC_APBRST_CR2_UART1RST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR2_UART1RST_RST	(0x1U << RCC_APBRST_CR2_UART1RST_Pos)	/* 1：复位 */

#define	RCC_APBRST_CR2_UART0RST_Pos	11	/* UART0模块复位 */
#define	RCC_APBRST_CR2_UART0RST_Msk	(0x1U << RCC_APBRST_CR2_UART0RST_Pos)
#define	RCC_APBRST_CR2_UART0RST_NORST	(0x0U << RCC_APBRST_CR2_UART0RST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR2_UART0RST_RST	(0x1U << RCC_APBRST_CR2_UART0RST_Pos)	/* 1：复位 */

#define	RCC_APBRST_CR2_SPI1RST_Pos	9	/* SPI1模块复位 */
#define	RCC_APBRST_CR2_SPI1RST_Msk	(0x1U << RCC_APBRST_CR2_SPI1RST_Pos)
#define	RCC_APBRST_CR2_SPI1RST_NORST	(0x0U << RCC_APBRST_CR2_SPI1RST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR2_SPI1RST_RST	(0x1U << RCC_APBRST_CR2_SPI1RST_Pos)	/* 1：复位 */

