wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_rcc.h
#define	RCC_APBRST_CR2_UCIRRST_Pos	8	/* UART红外调制模块复位 */
#define	RCC_APBRST_CR2_UCIRRST_Msk	(0x1U << RCC_APBRST_CR2_UCIRRST_Pos)
#define	RCC_APBRST_CR2_UCIRRST_NORST	(0x0U << RCC_APBRST_CR2_UCIRRST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR2_UCIRRST_RST	(0x1U << RCC_APBRST_CR2_UCIRRST_Pos)	/* 1：复位 */

#define	RCC_APBRST_CR2_LPUART1RST_Pos	7	/* LPUART1模块复位 */
#define	RCC_APBRST_CR2_LPUART1RST_Msk	(0x1U << RCC_APBRST_CR2_LPUART1RST_Pos)
#define	RCC_APBRST_CR2_LPUART1RST_NORST	(0x0U << RCC_APBRST_CR2_LPUART1RST_Pos)	/* 0：不复位 */
#define	RCC_APBRST_CR2_LPUART1RST_RST	(0x1U << RCC_APBRST_CR2_LPUART1RST_Pos)	/* 1：复位 */

#define	RCC_XTHF_CR_CFG_Pos	8	/* XTHF振荡强度配置 */
#define	RCC_XTHF_CR_CFG_Msk	(0x7U << RCC_XTHF_CR_CFG_Pos)

#define	RCC_XTHF_CR_EN_Pos	0	/* XTHF使能寄存器 */
#define	RCC_XTHF_CR_EN_Msk	(0x1U << RCC_XTHF_CR_EN_Pos)
	/* 0：关闭XTHF */
	/* 1：使能XTHF */

#define	RCC_RC4M_CR_PSC_Pos	16	/* RC4M输出预分频  */
#define	RCC_RC4M_CR_PSC_Msk	(0x3U << RCC_RC4M_CR_PSC_Pos)
#define	RCC_RC4M_CR_PSC_DIV1	(0x0U << RCC_RC4M_CR_PSC_Pos)	/* 00：不分频 */
#define	RCC_RC4M_CR_PSC_DIV4	(0x1U << RCC_RC4M_CR_PSC_Pos)	/* 01：4分频 */
#define	RCC_RC4M_CR_PSC_DIV8	(0x2U << RCC_RC4M_CR_PSC_Pos)	/* 10：8分频 */
#define	RCC_RC4M_CR_PSC_DIV16	(0x3U << RCC_RC4M_CR_PSC_Pos)	/* 11：16分频 */

#define	RCC_RC4M_CR_EN_Pos	0	/* RC4M使能寄存器 */
#define	RCC_RC4M_CR_EN_Msk	(0x1U << RCC_RC4M_CR_EN_Pos)
	/* 0：关闭RC4M */
	/* 1：打开RC4M */

#define	RCC_RCHF_TR_TRIM_Pos	0	/* RCHF频率调校寄存器 */
#define	RCC_RCHF_TR_TRIM_Msk	(0x7fU << RCC_RCHF_TR_TRIM_Pos)

#define	RCC_OPC_CR1_EXTICKE_Pos	31
#define	RCC_OPC_CR1_EXTICKE_Msk	(0x1U << RCC_OPC_CR1_EXTICKE_Pos)
	/* EXTI工作时钟使能，高有效 */

#define	RCC_OPC_CR1_EXTICKS_Pos	30	/* EXTI中断采样时钟选择 */
#define	RCC_OPC_CR1_EXTICKS_Msk	(0x1U << RCC_OPC_CR1_EXTICKS_Pos)
#define	RCC_OPC_CR1_EXTICKS_HCLK	(0x0U << RCC_OPC_CR1_EXTICKS_Pos)	/* 0：外部引脚中断使用HCLK采样 */
#define	RCC_OPC_CR1_EXTICKS_LSCLK	(0x1U << RCC_OPC_CR1_EXTICKS_Pos)	/* 1：外部引脚中断使用LSCLK采样 */

#define	RCC_OPC_CR1_LPUART1CKE_Pos	29
#define	RCC_OPC_CR1_LPUART1CKE_Msk	(0x1U << RCC_OPC_CR1_LPUART1CKE_Pos)
	/* LPUART1工作时钟使能，高有效 */

#define	RCC_OPC_CR1_LPUART0CKE_Pos	28
#define	RCC_OPC_CR1_LPUART0CKE_Msk	(0x1U << RCC_OPC_CR1_LPUART0CKE_Pos)
	/* LPUART0工作时钟使能，高有效 */

#define	RCC_OPC_CR1_LPUART1CKS_Pos	26
#define	RCC_OPC_CR1_LPUART1CKS_Msk	(0x3U << RCC_OPC_CR1_LPUART1CKS_Pos)
#define	RCC_OPC_CR1_LPUART1CKS_LSCLK	(0x0U << RCC_OPC_CR1_LPUART1CKS_Pos)	/* LPUART1工作时钟选择 */
#define	RCC_OPC_CR1_LPUART1CKS_RCHFDIV	(0x1U << RCC_OPC_CR1_LPUART1CKS_Pos)
#define	RCC_OPC_CR1_LPUART1CKS_RC4MDIV	(0x2U << RCC_OPC_CR1_LPUART1CKS_Pos)

#define	RCC_OPC_CR1_LPUART0CKS_Pos	24
#define	RCC_OPC_CR1_LPUART0CKS_Msk	(0x3U << RCC_OPC_CR1_LPUART0CKS_Pos)
#define	RCC_OPC_CR1_LPUART0CKS_LSCLK	(0x0U << RCC_OPC_CR1_LPUART0CKS_Pos)	/* LPUART0工作时钟选择 */
#define	RCC_OPC_CR1_LPUART0CKS_RCHFDIV	(0x1U << RCC_OPC_CR1_LPUART0CKS_Pos)
#define	RCC_OPC_CR1_LPUART0CKS_RC4MDIV	(0x2U << RCC_OPC_CR1_LPUART0CKS_Pos)

#define	RCC_OPC_CR1_BEEPCKE_Pos	21
#define	RCC_OPC_CR1_BEEPCKE_Msk	(0x1U << RCC_OPC_CR1_BEEPCKE_Pos)
	/* Beeper工作时钟使能，高有效 */

#define	RCC_OPC_CR1_I2CCKE_Pos	20
#define	RCC_OPC_CR1_I2CCKE_Msk	(0x1U << RCC_OPC_CR1_I2CCKE_Pos)
	/* I2C工作时钟使能 */

#define	RCC_OPC_CR1_BEEPCKS_Pos	18
#define	RCC_OPC_CR1_BEEPCKS_Msk	(0x1U << RCC_OPC_CR1_BEEPCKS_Pos)
#define	RCC_OPC_CR1_BEEPCKS_XTLF	(0x0U << RCC_OPC_CR1_BEEPCKS_Pos)	/* Beeper工作时钟选择 */
#define	RCC_OPC_CR1_BEEPCKS_RCLP	(0x1U << RCC_OPC_CR1_BEEPCKS_Pos)

#define	RCC_OPC_CR1_I2CCKS_Pos	16	/* I2C主机工作时钟选择 */
#define	RCC_OPC_CR1_I2CCKS_Msk	(0x3U << RCC_OPC_CR1_I2CCKS_Pos)
#define	RCC_OPC_CR1_I2CCKS_APBCLK	(0x0U << RCC_OPC_CR1_I2CCKS_Pos)	/* 00：APBCLK */
#define	RCC_OPC_CR1_I2CCKS_RCHF	(0x1U << RCC_OPC_CR1_I2CCKS_Pos)	/* 01：RCHF */
#define	RCC_OPC_CR1_I2CCKS_SYSCLK	(0x2U << RCC_OPC_CR1_I2CCKS_Pos)	/* 10：SYSCLK */
#define	RCC_OPC_CR1_I2CCKS_RC4MPSC	(0x3U << RCC_OPC_CR1_I2CCKS_Pos)	/* 11：RC4M_PSC */

#define	RCC_OPC_CR1_UART1CKE_Pos	9
#define	RCC_OPC_CR1_UART1CKE_Msk	(0x1U << RCC_OPC_CR1_UART1CKE_Pos)
	/* UART1工作时钟使能，高有效 */

#define	RCC_OPC_CR1_UART0CKE_Pos	8
#define	RCC_OPC_CR1_UART0CKE_Msk	(0x1U << RCC_OPC_CR1_UART0CKE_Pos)
	/* UART0工作时钟使能，高有效 */

#define	RCC_OPC_CR1_UART1CKS_Pos	2	/* UART1工作时钟选择 */
#define	RCC_OPC_CR1_UART1CKS_Msk	(0x3U << RCC_OPC_CR1_UART1CKS_Pos)
#define	RCC_OPC_CR1_UART1CKS_APBCLK	(0x0U << RCC_OPC_CR1_UART1CKS_Pos)	/* 00：APBCLK */
#define	RCC_OPC_CR1_UART1CKS_RCHF	(0x1U << RCC_OPC_CR1_UART1CKS_Pos)	/* 01：RCHF */
#define	RCC_OPC_CR1_UART1CKS_SYSCLK	(0x2U << RCC_OPC_CR1_UART1CKS_Pos)	/* 10：SYSCLK */
#define	RCC_OPC_CR1_UART1CKS_RC4MPSC	(0x3U << RCC_OPC_CR1_UART1CKS_Pos)	/* 11：RC4M_PSC */

#define	RCC_OPC_CR1_UART0CKS_Pos	0	/* UART0工作时钟选择 */
#define	RCC_OPC_CR1_UART0CKS_Msk	(0x3U << RCC_OPC_CR1_UART0CKS_Pos)
#define	RCC_OPC_CR1_UART0CKS_APBCLK	(0x0U << RCC_OPC_CR1_UART0CKS_Pos)	/* 00：APBCLK */
#define	RCC_OPC_CR1_UART0CKS_RCHF	(0x1U << RCC_OPC_CR1_UART0CKS_Pos)	/* 01：RCHF */
#define	RCC_OPC_CR1_UART0CKS_SYSCLK	(0x2U << RCC_OPC_CR1_UART0CKS_Pos)	/* 10：SYSCLK */
#define	RCC_OPC_CR1_UART0CKS_RC4MPSC	(0x3U << RCC_OPC_CR1_UART0CKS_Pos)	/* 11：RC4M_PSC */

#define	RCC_OPC_CR2_RNGPRSC_Pos	28	/* 随机数发生器工作时钟分频 */
#define	RCC_OPC_CR2_RNGPRSC_Msk	(0x7U << RCC_OPC_CR2_RNGPRSC_Pos)
#define	RCC_OPC_CR2_RNGPRSC_DIV1	(0x0U << RCC_OPC_CR2_RNGPRSC_Pos)	/* 000：不分频 */
#define	RCC_OPC_CR2_RNGPRSC_DIV2	(0x1U << RCC_OPC_CR2_RNGPRSC_Pos)	/* 001：2分频 */
#define	RCC_OPC_CR2_RNGPRSC_DIV4	(0x2U << RCC_OPC_CR2_RNGPRSC_Pos)	/* 010：4分频 */
#define	RCC_OPC_CR2_RNGPRSC_DIV8	(0x3U << RCC_OPC_CR2_RNGPRSC_Pos)	/* 011：8分频 */
#define	RCC_OPC_CR2_RNGPRSC_DIV16	(0x4U << RCC_OPC_CR2_RNGPRSC_Pos)	/* 100：16分频 */
#define	RCC_OPC_CR2_RNGPRSC_DIV32	(0x5U << RCC_OPC_CR2_RNGPRSC_Pos)	/* 101：32分频 */

#define	RCC_OPC_CR2_ADCPRSC_Pos	24	/* ADC工作时钟预分频 */
#define	RCC_OPC_CR2_ADCPRSC_Msk	(0x7U << RCC_OPC_CR2_ADCPRSC_Pos)
#define	RCC_OPC_CR2_ADCPRSC_DIV1	(0x0U << RCC_OPC_CR2_ADCPRSC_Pos)	/* 000：不分频 */
#define	RCC_OPC_CR2_ADCPRSC_DIV2	(0x1U << RCC_OPC_CR2_ADCPRSC_Pos)	/* 001：2分频 */
#define	RCC_OPC_CR2_ADCPRSC_DIV4	(0x2U << RCC_OPC_CR2_ADCPRSC_Pos)	/* 010：4分频 */
#define	RCC_OPC_CR2_ADCPRSC_DIV8	(0x3U << RCC_OPC_CR2_ADCPRSC_Pos)	/* 011：8分频 */
#define	RCC_OPC_CR2_ADCPRSC_DIV16	(0x4U << RCC_OPC_CR2_ADCPRSC_Pos)	/* 100：16分频 */
#define	RCC_OPC_CR2_ADCPRSC_DIV32	(0x5U << RCC_OPC_CR2_ADCPRSC_Pos)	/* 101：32分频 */

