wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_rcc.h
#define	RCC_OPC_CR2_FLSCKE_Pos	22
#define	RCC_OPC_CR2_FLSCKE_Msk	(0x1U << RCC_OPC_CR2_FLSCKE_Pos)
	/* Flash擦写时钟使能，高有效  */

#define	RCC_OPC_CR2_RNGCKE_Pos	21
#define	RCC_OPC_CR2_RNGCKE_Msk	(0x1U << RCC_OPC_CR2_RNGCKE_Pos)
	/* 随机数发生器工作时钟使能，高有效  */

#define	RCC_OPC_CR2_ADCCKE_Pos	20
#define	RCC_OPC_CR2_ADCCKE_Msk	(0x1U << RCC_OPC_CR2_ADCCKE_Pos)
	/* ADC工作时钟使能，高有效 */

#define	RCC_OPC_CR2_ADCCKS_Pos	16	/* ADC工作时钟选择 */
#define	RCC_OPC_CR2_ADCCKS_Msk	(0x3U << RCC_OPC_CR2_ADCCKS_Pos)
#define	RCC_OPC_CR2_ADCCKS_RC4MPSC	(0x0U << RCC_OPC_CR2_ADCCKS_Pos)	/* 00：RC4M_PSC */
#define	RCC_OPC_CR2_ADCCKS_RCHF	(0x1U << RCC_OPC_CR2_ADCCKS_Pos)	/* 01：RCHF */
#define	RCC_OPC_CR2_ADCCKS_XTHF	(0x2U << RCC_OPC_CR2_ADCCKS_Pos)	/* 10：XTHF */
#define	RCC_OPC_CR2_ADCCKS_PLL	(0x3U << RCC_OPC_CR2_ADCCKS_Pos)	/* 11：PLL */

#define	RCC_OPC_CR2_LPTCKE_Pos	12
#define	RCC_OPC_CR2_LPTCKE_Msk	(0x1U << RCC_OPC_CR2_LPTCKE_Pos)
	/* LPTIM工作时钟使能，高有效 */

#define	RCC_OPC_CR2_LPTCKS_Pos	8	/* LPTIM工作时钟选择 */
#define	RCC_OPC_CR2_LPTCKS_Msk	(0x3U << RCC_OPC_CR2_LPTCKS_Pos)
#define	RCC_OPC_CR2_LPTCKS_APBCLK	(0x0U << RCC_OPC_CR2_LPTCKS_Pos)	/* 00：APBCLK */
#define	RCC_OPC_CR2_LPTCKS_LSCLK	(0x1U << RCC_OPC_CR2_LPTCKS_Pos)	/* 01：LSCLK */
#define	RCC_OPC_CR2_LPTCKS_RCLP	(0x2U << RCC_OPC_CR2_LPTCKS_Pos)	/* 10：RCLP */
#define	RCC_OPC_CR2_LPTCKS_RC4MPSC	(0x3U << RCC_OPC_CR2_LPTCKS_Pos)	/* 11：RC4MPSC */

#define	RCC_OPC_CR2_BTCKE_Pos	4
#define	RCC_OPC_CR2_BTCKE_Msk	(0x1U << RCC_OPC_CR2_BTCKE_Pos)
	/* BSTIM工作时钟使能，高有效 */

#define	RCC_OPC_CR2_BTCKS_Pos	0	/* BSTIM工作时钟源选择 */
#define	RCC_OPC_CR2_BTCKS_Msk	(0x3U << RCC_OPC_CR2_BTCKS_Pos)
#define	RCC_OPC_CR2_BTCKS_APBCLK	(0x0U << RCC_OPC_CR2_BTCKS_Pos)	/* 00：APBCLK */
#define	RCC_OPC_CR2_BTCKS_LSCLK	(0x1U << RCC_OPC_CR2_BTCKS_Pos)	/* 01：LSCLK */
#define	RCC_OPC_CR2_BTCKS_RCLP	(0x2U << RCC_OPC_CR2_BTCKS_Pos)	/* 10：RCLP */
#define	RCC_OPC_CR2_BTCKS_RC4MPSC	(0x3U << RCC_OPC_CR2_BTCKS_Pos)	/* 11：RC4MPSC */

#define	RCC_FDET_IER_HFDET_IE_Pos	1
#define	RCC_FDET_IER_HFDET_IE_Msk	(0x1U << RCC_FDET_IER_HFDET_IE_Pos)
	/* XTHF高频检测报警中断使能，1有效 */

#define	RCC_FDET_IER_LFDET_IE_Pos	0
#define	RCC_FDET_IER_LFDET_IE_Msk	(0x1U << RCC_FDET_IER_LFDET_IE_Pos)
	/* XTLF低频检测报警中断使能，1有效 */

#define	RCC_FDET_ISR_HFDETO_Pos	9	/* 高频晶体停振检测模块输出 */
#define	RCC_FDET_ISR_HFDETO_Msk	(0x1U << RCC_FDET_ISR_HFDETO_Pos)

#define	RCC_FDET_ISR_LFDETO_Pos	8	/* 低频晶体停振检测模块输出 */
#define	RCC_FDET_ISR_LFDETO_Msk	(0x1U << RCC_FDET_ISR_LFDETO_Pos)

#define	RCC_FDET_ISR_HFDETIF_Pos	1	/* 高频停振检测中断标志寄存器 */
#define	RCC_FDET_ISR_HFDETIF_Msk	(0x1U << RCC_FDET_ISR_HFDETIF_Pos)

#define	RCC_FDET_ISR_LFDETIF_Pos	0	/* 低频停振检测中断标志寄存器 */
#define	RCC_FDET_ISR_LFDETIF_Msk	(0x1U << RCC_FDET_ISR_LFDETIF_Pos)

#define	RCC_PDR_CR_CFG_Pos	1	/* 下电复位电压配置 */
#define	RCC_PDR_CR_CFG_Msk	(0x3U << RCC_PDR_CR_CFG_Pos)
#define	RCC_PDR_CR_CFG_1_5V	(0x0U << RCC_PDR_CR_CFG_Pos)	/* 00—1.5V */
#define	RCC_PDR_CR_CFG_1_25V	(0x1U << RCC_PDR_CR_CFG_Pos)	/* 01—1.25V */
#define	RCC_PDR_CR_CFG_1_35V	(0x2U << RCC_PDR_CR_CFG_Pos)	/* 10—1.35V */
#define	RCC_PDR_CR_CFG_1_4V	(0x3U << RCC_PDR_CR_CFG_Pos)	/* 11—1.4V */

#define	RCC_PDR_CR_EN_Pos	0	/* 下电复位使能 */
#define	RCC_PDR_CR_EN_Msk	(0x1U << RCC_PDR_CR_EN_Pos)

#define	RCC_BOR_CR_CFG_Pos	1	/* 下电复位电压配置 */
#define	RCC_BOR_CR_CFG_Msk	(0x3U << RCC_BOR_CR_CFG_Pos)
#define	RCC_BOR_CR_CFG_1_7V	(0x0U << RCC_BOR_CR_CFG_Pos)	/* 00—1.7V */
#define	RCC_BOR_CR_CFG_1_6V	(0x1U << RCC_BOR_CR_CFG_Pos)	/* 01—1.6V */
#define	RCC_BOR_CR_CFG_1_65V	(0x2U << RCC_BOR_CR_CFG_Pos)	/* 10—1.65V */
#define	RCC_BOR_CR_CFG_1_75V	(0x3U << RCC_BOR_CR_CFG_Pos)	/* 11—1.75V */

#define	RCC_BOR_CR_OFF_BOR_Pos	0	/* 下电复位使能 */
#define	RCC_BOR_CR_OFF_BOR_Msk	(0x1U << RCC_BOR_CR_OFF_BOR_Pos)
	/* 0：使能BOR */
	/* 1：关闭BOR */
  
//Macro_End
								
/* Exported functions --------------------------------------------------------*/ 
extern void RCC_Deinit(void);
extern void RCC_LKP_CR_RST_EN_Setable(FunState NewState);
extern FunState RCC_LKP_CR_RST_EN_Getable(void);
extern void RCC_SOFTRST_Write(uint32_t SetValue);
extern void RCC_RSTFR_NRSTN_FLAG_Clr(void);
extern FlagStatus RCC_RSTFR_NRSTN_FLAG_Chk(void);
extern void RCC_RSTFR_TESTN_FLAG_Clr(void);
extern FlagStatus RCC_RSTFR_TESTN_FLAG_Chk(void);
extern void RCC_RSTFR_PORN_FLAG_Clr(void);
extern FlagStatus RCC_RSTFR_PORN_FLAG_Chk(void);
extern void RCC_RSTFR_PDRN_FLAG_Clr(void);
extern FlagStatus RCC_RSTFR_PDRN_FLAG_Chk(void);
extern void RCC_RSTFR_SOFTN_FLAG_Clr(void);
extern FlagStatus RCC_RSTFR_SOFTN_FLAG_Chk(void);
extern void RCC_RSTFR_IWDTN_FLAG_Clr(void);
extern FlagStatus RCC_RSTFR_IWDTN_FLAG_Chk(void);
extern void RCC_RSTFR_WWDTN_FLAG_Clr(void);
extern FlagStatus RCC_RSTFR_WWDTN_FLAG_Chk(void);
extern void RCC_RSTFR_LKUPN_FLAG_Clr(void);
extern FlagStatus RCC_RSTFR_LKUPN_FLAG_Chk(void);
extern void RCC_RSTFR_NVICN_FLAG_Clr(void);
extern FlagStatus RCC_RSTFR_NVICN_FLAG_Chk(void);

/* LSCLK自动切换使能 相关函数 */
extern void RCC_SYSCLK_CR_LSCATS_Setable(FunState NewState);
extern FunState RCC_SYSCLK_CR_LSCATS_Getable(void);

/* Sleep/DeepSleep模式下EXTI采样设置 相关函数 */
extern void RCC_SYSCLK_CR_SLP_ENEXTI_Setable(FunState NewState);
extern FunState RCC_SYSCLK_CR_SLP_ENEXTI_Getable(void);

/* APB时钟分频选择 相关函数 */
extern void RCC_SYSCLK_CR_APBPRES_Set(uint32_t SetValue);
extern uint32_t RCC_SYSCLK_CR_APBPRES_Get(void);

/* AHB时钟分频选择 相关函数 */
extern void RCC_SYSCLK_CR_AHBPRES_Set(uint32_t SetValue);
extern uint32_t RCC_SYSCLK_CR_AHBPRES_Get(void);

/* CPU内核systick工作时钟选择 相关函数 */
extern void RCC_SYSCLK_CR_STCLKSEL_Set(uint32_t SetValue);
extern uint32_t RCC_SYSCLK_CR_STCLKSEL_Get(void);

/* 系统时钟源选择 相关函数 */
extern void RCC_SYSCLK_CR_SYSCLKSEL_Set(uint32_t SetValue);
extern uint32_t RCC_SYSCLK_CR_SYSCLKSEL_Get(void);

/* RCHF频率选择寄存器 相关函数 */
extern void RCC_RCHF_CR_FSEL_Set(uint32_t SetValue);
extern uint32_t RCC_RCHF_CR_FSEL_Get(void);

/* RCHF使能寄存器 相关函数 */
extern void RCC_RCHF_CR_EN_Setable(FunState NewState);
extern FunState RCC_RCHF_CR_EN_Getable(void);

/* RC4M频率调校寄存器 相关函数 */
extern void RCC_RC4M_TR_Write(uint32_t SetValue);
extern uint32_t RCC_RC4M_TR_Read(void);

