wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_rcc.h
/* PLL倍频比 相关函数 */
extern void RCC_PLL_CR_Write(uint32_t SetValue);
extern uint32_t RCC_PLL_CR_Read(void);

/* PLL锁定标志 相关函数 */
extern FlagStatus RCC_PLL_CR_LOCKED_Chk(void);

/* PLL参考时钟预分频（目标是产生1MHz参考时钟给PLL） 相关函数 */
extern void RCC_PLL_CR_REFPRSC_Set(uint32_t SetValue);
extern uint32_t RCC_PLL_CR_REFPRSC_Get(void);

/* PLL输出选择寄存器 相关函数 */
extern void RCC_PLL_CR_OSEL_Set(uint32_t SetValue);
extern uint32_t RCC_PLL_CR_OSEL_Get(void);

/* PLL输入选择寄存器 相关函数 */
extern void RCC_PLL_CR_INSEL_Set(uint32_t SetValue);
extern uint32_t RCC_PLL_CR_INSEL_Get(void);

/* PLL使能寄存器 相关函数 */
extern void RCC_PLL_CR_EN_Setable(FunState NewState);
extern FunState RCC_PLL_CR_EN_Getable(void);

/* RCLP使能标志信号 相关函数 */
extern FlagStatus RCC_RCLP_CR_OFF_EN_Chk(void);

/* 休眠模式下RCLP控制寄存器 相关函数 */
extern void RCC_RCLP_CR_LPM_RCLP_OFF_Setable(FunState NewState);
extern FunState RCC_RCLP_CR_LPM_RCLP_OFF_Getable(void);

/* RCLP调校值寄存器 相关函数 */
extern void RCC_RCLP_TR_Write(uint32_t SetValue);
extern uint32_t RCC_RCLP_TR_Read(void);

/* XTLF备份时钟手动切换寄存器 相关函数 */
extern void RCC_XTLF_CR_Write(uint32_t SetValue);
extern uint32_t RCC_XTLF_CR_Read(void);

/* XTLF使能寄存器 相关函数 */
extern void RCC_XTLF_CR_EN_Set(uint32_t SetValue);
extern uint32_t RCC_XTLF_CR_EN_Get(void);

/* XTLF工作电流选择 相关函数 */
extern void RCC_XTLF_CR_IPW_Set(uint32_t SetValue);
extern uint32_t RCC_XTLF_CR_IPW_Get(void);

/* AHB Master优先级配置寄存器 相关函数 */
extern void RCC_AHBM_CR_MPRIL_Set(uint32_t SetValue);
extern uint32_t RCC_AHBM_CR_MPRIL_Get(void);

/* 外设模块复位使能 相关函数 */
extern void RCC_PRST_EN_Write(uint32_t SetValue);
extern uint32_t RCC_PRST_EN_Read(void);

/* DMA模块复位 相关函数 */
extern void RCC_AHBRST_CR_DMARST_Setable(FunState NewState);
extern FunState RCC_AHBRST_CR_DMARST_Getable(void);

/* UART5模块复位 相关函数 */
extern void RCC_APBRST_CR1_UART5RST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR1_UART5RST_Getable(void);

/* UART4模块复位 相关函数 */
extern void RCC_APBRST_CR1_UART4RST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR1_UART4RST_Getable(void);

/* GPTIM1模块复位 相关函数 */
extern void RCC_APBRST_CR1_GT1RST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR1_GT1RST_Getable(void);

/* GPTIM0模块复位 相关函数 */
extern void RCC_APBRST_CR1_GT0RST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR1_GT0RST_Getable(void);

/* LCD模块复位 相关函数 */
extern void RCC_APBRST_CR1_LCDRST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR1_LCDRST_Getable(void);

/* U7816模块复位 相关函数 */
extern void RCC_APBRST_CR1_U7816RST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR1_U7816RST_Getable(void);

/* SPI2模块复位 相关函数 */
extern void RCC_APBRST_CR1_SPI2RST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR1_SPI2RST_Getable(void);

/* LPUART0模块复位 相关函数 */
extern void RCC_APBRST_CR1_LPUART0RST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR1_LPUART0RST_Getable(void);

/* I2C模块复位 相关函数 */
extern void RCC_APBRST_CR1_I2CRST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR1_I2CRST_Getable(void);

/* LPTIM32模块复位 相关函数 */
extern void RCC_APBRST_CR1_LPT32RST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR1_LPT32RST_Getable(void);

/* ATIM模块复位 相关函数 */
extern void RCC_APBRST_CR2_ATRST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR2_ATRST_Getable(void);

/* BSTIM模块复位 相关函数 */
extern void RCC_APBRST_CR2_BTRST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR2_BTRST_Getable(void);

/* ADC控制器复位 相关函数 */
extern void RCC_APBRST_CR2_ADCCRST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR2_ADCCRST_Getable(void);

/* ADC模块复位 相关函数 */
extern void RCC_APBRST_CR2_ADCRST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR2_ADCRST_Getable(void);

/* 运放模块复位 相关函数 */
extern void RCC_APBRST_CR2_OPARST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR2_OPARST_Getable(void);

/* AES模块复位 相关函数 */
extern void RCC_APBRST_CR2_AESRST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR2_AESRST_Getable(void);

/* CRC模块复位 相关函数 */
extern void RCC_APBRST_CR2_CRCRST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR2_CRCRST_Getable(void);

/* RNG模块复位 相关函数 */
extern void RCC_APBRST_CR2_RNGRST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR2_RNGRST_Getable(void);

/* UART1模块复位 相关函数 */
extern void RCC_APBRST_CR2_UART1RST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR2_UART1RST_Getable(void);

/* UART0模块复位 相关函数 */
extern void RCC_APBRST_CR2_UART0RST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR2_UART0RST_Getable(void);

/* SPI1模块复位 相关函数 */
extern void RCC_APBRST_CR2_SPI1RST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR2_SPI1RST_Getable(void);

/* UART红外调制模块复位 相关函数 */
extern void RCC_APBRST_CR2_UCIRRST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR2_UCIRRST_Getable(void);

/* LPUART1模块复位 相关函数 */
extern void RCC_APBRST_CR2_LPUART1RST_Setable(FunState NewState);
extern FunState RCC_APBRST_CR2_LPUART1RST_Getable(void);

/* XTHF振荡强度配置 相关函数 */
extern void RCC_XTHF_CR_CFG_Set(uint32_t SetValue);
extern uint32_t RCC_XTHF_CR_CFG_Get(void);

/* XTHF使能寄存器 相关函数 */
extern void RCC_XTHF_CR_EN_Setable(FunState NewState);
extern FunState RCC_XTHF_CR_EN_Getable(void);

/* RC4M输出预分频  相关函数 */
extern void RCC_RC4M_CR_PSC_Set(uint32_t SetValue);
extern uint32_t RCC_RC4M_CR_PSC_Get(void);

/* RC4M使能寄存器 相关函数 */
extern void RCC_RC4M_CR_EN_Setable(FunState NewState);
extern FunState RCC_RC4M_CR_EN_Getable(void);

/* RCHF频率调校寄存器 相关函数 */
extern void RCC_RCHF_TR_Write(uint32_t SetValue);
extern uint32_t RCC_RCHF_TR_Read(void);

extern void RCC_OPC_CR1_EXTICKE_Setable(FunState NewState);
extern FunState RCC_OPC_CR1_EXTICKE_Getable(void);

/* EXTI中断采样时钟选择 相关函数 */
extern void RCC_OPC_CR1_EXTICKS_Set(uint32_t SetValue);
extern uint32_t RCC_OPC_CR1_EXTICKS_Get(void);
extern void RCC_OPC_CR1_LPUART1CKE_Setable(FunState NewState);
extern FunState RCC_OPC_CR1_LPUART1CKE_Getable(void);
extern void RCC_OPC_CR1_LPUART0CKE_Setable(FunState NewState);
extern FunState RCC_OPC_CR1_LPUART0CKE_Getable(void);
extern void RCC_OPC_CR1_LPUART1CKS_Set(uint32_t SetValue);
extern uint32_t RCC_OPC_CR1_LPUART1CKS_Get(void);
extern void RCC_OPC_CR1_LPUART0CKS_Set(uint32_t SetValue);
extern uint32_t RCC_OPC_CR1_LPUART0CKS_Get(void);
extern void RCC_OPC_CR1_BEEPCKE_Setable(FunState NewState);
extern FunState RCC_OPC_CR1_BEEPCKE_Getable(void);
extern void RCC_OPC_CR1_I2CCKE_Setable(FunState NewState);
extern FunState RCC_OPC_CR1_I2CCKE_Getable(void);
extern void RCC_OPC_CR1_BEEPCKS_Set(uint32_t SetValue);
extern uint32_t RCC_OPC_CR1_BEEPCKS_Get(void);

/* I2C主机工作时钟选择 相关函数 */
extern void RCC_OPC_CR1_I2CCKS_Set(uint32_t SetValue);
extern uint32_t RCC_OPC_CR1_I2CCKS_Get(void);
extern void RCC_OPC_CR1_UART1CKE_Setable(FunState NewState);
extern FunState RCC_OPC_CR1_UART1CKE_Getable(void);
extern void RCC_OPC_CR1_UART0CKE_Setable(FunState NewState);
extern FunState RCC_OPC_CR1_UART0CKE_Getable(void);

