wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_rcc.h
/* UART1工作时钟选择 相关函数 */
extern void RCC_OPC_CR1_UART1CKS_Set(uint32_t SetValue);
extern uint32_t RCC_OPC_CR1_UART1CKS_Get(void);

/* UART0工作时钟选择 相关函数 */
extern void RCC_OPC_CR1_UART0CKS_Set(uint32_t SetValue);
extern uint32_t RCC_OPC_CR1_UART0CKS_Get(void);

/* 随机数发生器工作时钟分频 相关函数 */
extern void RCC_OPC_CR2_RNGPRSC_Set(uint32_t SetValue);
extern uint32_t RCC_OPC_CR2_RNGPRSC_Get(void);

/* ADC工作时钟预分频 相关函数 */
extern void RCC_OPC_CR2_ADCPRSC_Set(uint32_t SetValue);
extern uint32_t RCC_OPC_CR2_ADCPRSC_Get(void);
extern void RCC_OPC_CR2_FLSCKE_Setable(FunState NewState);
extern FunState RCC_OPC_CR2_FLSCKE_Getable(void);
extern void RCC_OPC_CR2_RNGCKE_Setable(FunState NewState);
extern FunState RCC_OPC_CR2_RNGCKE_Getable(void);
extern void RCC_OPC_CR2_ADCCKE_Setable(FunState NewState);
extern FunState RCC_OPC_CR2_ADCCKE_Getable(void);

/* ADC工作时钟选择 相关函数 */
extern void RCC_OPC_CR2_ADCCKS_Set(uint32_t SetValue);
extern uint32_t RCC_OPC_CR2_ADCCKS_Get(void);
extern void RCC_OPC_CR2_LPTCKE_Setable(FunState NewState);
extern FunState RCC_OPC_CR2_LPTCKE_Getable(void);

/* LPTIM工作时钟选择 相关函数 */
extern void RCC_OPC_CR2_LPTCKS_Set(uint32_t SetValue);
extern uint32_t RCC_OPC_CR2_LPTCKS_Get(void);
extern void RCC_OPC_CR2_BTCKE_Setable(FunState NewState);
extern FunState RCC_OPC_CR2_BTCKE_Getable(void);

/* BSTIM工作时钟源选择 相关函数 */
extern void RCC_OPC_CR2_BTCKS_Set(uint32_t SetValue);
extern uint32_t RCC_OPC_CR2_BTCKS_Get(void);

/* 外设时钟配置函数 */
extern void RCC_PERCLK_SetableEx(uint32_t periph_def, FunState NewState);

/* RCHF初始化 */
void RCC_RCHF_Init(RCC_RCHF_InitTypeDef* para);

/* PLL初始化 */
void RCC_PLL_Init(RCC_PLL_InitTypeDef* para);

/* 系统时钟初始化 */
void RCC_SysClk_Init(RCC_SYSCLK_InitTypeDef* para);

/* RC4M初始化 */
void RCC_RC4M_Init(RCC_RC4M_InitTypeDef* para);

extern void RCC_Init_RCHF_Trim( uint8_t ClkMode );

extern void RCC_GetClocksFreq(RCC_ClocksType* para);

extern void RCC_FDET_IER_HFDET_IE_Setable(FunState NewState);
extern FunState RCC_FDET_IER_HFDET_IE_Getable(void);
extern void RCC_FDET_IER_LFDET_IE_Setable(FunState NewState);
extern FunState RCC_FDET_IER_LFDET_IE_Getable(void);

/* 高频晶体停振检测模块输出 相关函数 */
extern void RCC_FDET_ISR_HFDETO_Clr(void);
extern FlagStatus RCC_FDET_ISR_HFDETO_Chk(void);

/* 低频晶体停振检测模块输出 相关函数 */
extern FlagStatus RCC_FDET_ISR_LFDETO_Chk(void);

/* 高频停振检测中断标志寄存器 相关函数 */
extern FlagStatus RCC_FDET_ISR_HFDETIF_Chk(void);

/* 低频停振检测中断标志寄存器 相关函数 */
extern void RCC_FDET_ISR_LFDETIF_Clr(void);
extern FlagStatus RCC_FDET_ISR_LFDETIF_Chk(void);

/* 下电复位电压配置 相关函数 */
extern void RCC_PDR_CR_CFG_Set(uint32_t SetValue);
extern uint32_t RCC_PDR_CR_CFG_Get(void);

/* 下电复位使能 相关函数 */
extern void RCC_PDR_CR_EN_Setable(FunState NewState);
extern FunState RCC_PDR_CR_EN_Getable(void);

extern void RCC_BOR_Deinit(void);

/* 下电复位电压配置 相关函数 */
extern void RCC_BOR_CR_CFG_Set(uint32_t SetValue);
extern uint32_t RCC_BOR_CR_CFG_Get(void);

/* 下电复位使能 相关函数 */
extern void RCC_BOR_CR_OFF_BOR_Setable(FunState NewState);
extern FunState RCC_BOR_CR_OFF_BOR_Getable(void);

/* 其他宏定义 */
//外设时钟控制参数定义
#define	DCUCLK			(0x01000000 + RCC_PCLK_CR1_DCU_PCE_Pos)	//31	//DCU总线时钟使能，高使能
#define	BEEPCLK		  (0x01000000 + RCC_PCLK_CR1_BEEP_PCE_Pos)	//16	//BEEPER总线时钟使能，高使能
#define	PADCLK		  (0x01000000 + RCC_PCLK_CR1_PAD_PCE_Pos)	//7	//PADCFG总线时钟使能，高使能
#define	ANACCLK			(0x01000000 + RCC_PCLK_CR1_ANAC_PCE_Pos)	//6	//ANAC总线时钟使能，高使能
#define	IWDTCLK			(0x01000000 + RCC_PCLK_CR1_IWDT_PCE_Pos)	//5	//IWDT总线时钟使能，高使能
#define	SCUCLK			(0x01000000 + RCC_PCLK_CR1_SCU_PCE_Pos)	//4	//SCU总线时钟使能，高使能
#define	PMUCLK			(0x01000000 + RCC_PCLK_CR1_PMU_PCE_Pos)	//3	//PMU总线时钟使能，高使能
#define	RTCCLK			(0x01000000 + RCC_PCLK_CR1_RTC_PCE_Pos)	//2	//RTC总线时钟使能，高使能
#define	LPTCLK			(0x01000000 + RCC_PCLK_CR1_LPT_PCE_Pos)	//0	//LPTIM总线时钟使能，高使能   

#define	ADCCLK			(0x02000000 + RCC_PCLK_CR2_ADC_PCE_Pos)	//8	/* ADC时钟使能，高使能 */
#define	WWDTCLK			(0x02000000 + RCC_PCLK_CR2_WWDT_PCE_Pos)	//7	/* WWDT时钟使能，高使能 */
#define	RAMBISTCLK	(0x02000000 + RCC_PCLK_CR2_RAMBIST_PCE_Pos)	//6	/* RAMBIST时钟使能，高使能 */
#define	FLSCLK			(0x02000000 + RCC_PCLK_CR2_FLS_PCE_Pos)	//5	/* FLSC（Flash擦写控制器）时钟使能，高使能 */
#define	DMACLK			(0x02000000 + RCC_PCLK_CR2_DMA_PCE_Pos)	//4	/* DMA时钟使能，高使能 */
#define	LCDCLK			(0x02000000 + RCC_PCLK_CR2_LCD_PCE_Pos)	//3	/* LCD时钟使能，高使能 */
#define	AESCLK			(0x02000000 + RCC_PCLK_CR2_AES_PCE_Pos)	//2	/* AES时钟使能，高使能 */
#define	RNGCLK			(0x02000000 + RCC_PCLK_CR2_RNG_PCE_Pos)	//1	/* RNG时钟使能，高使能 */
#define	CRCCLK			(0x02000000 + RCC_PCLK_CR2_CRC_PCE_Pos)	//0	/* CRC时钟使能，高使能 */

#define	I2CCLK			(0x03000000 + RCC_PCLK_CR3_I2C_PCE_Pos)	//24	//I2C总线时钟使能
#define	LPUART1CLK		(0x03000000 + RCC_PCLK_CR3_LPUART1_PCE_Pos)	//18	//LPUART1总线时钟使能
#define	U7816CLK		(0x03000000 + RCC_PCLK_CR3_U7816_PCE_Pos)	//16	//U7816总线时钟使能，高使能
#define	LPUART0CLK		(0x03000000 + RCC_PCLK_CR3_LPUART0_PCE_Pos)	//15	//LPUART0总线时钟使能
#define	UCIRCLK   	(0x03000000 + RCC_PCLK_CR3_UCIR_PCE_Pos)	//14	//UART红外调制总线时钟使能
#define	UART5CLK		(0x03000000 + RCC_PCLK_CR3_UART5_PCE_Pos)	//13	//UART5总线时钟使能
#define	UART4CLK		(0x03000000 + RCC_PCLK_CR3_UART4_PCE_Pos)	//12	//UART4总线时钟使能
#define	UART1CLK		(0x03000000 + RCC_PCLK_CR3_UART1_PCE_Pos)	//9	//UART1总线时钟使能
#define	UART0CLK		(0x03000000 + RCC_PCLK_CR3_UART0_PCE_Pos)	//8	//UART0总线时钟使能
#define	SPI2CLK			(0x03000000 + RCC_PCLK_CR3_SPI2_PCE_Pos)	//1	/* SPI2时钟使能 */
#define	SPI1CLK			(0x03000000 + RCC_PCLK_CR3_SPI1_PCE_Pos)	//0	/* SPI1时钟使能 */

#define	ATCLK		(0x04000000 + RCC_PCLK_CR4_AT_PCE_Pos)	//4	/* 计量模拟电路时钟1使能，高使能 */
#define	GT1CLK		(0x04000000 + RCC_PCLK_CR4_GT1_PCE_Pos)	//3	/* 计量模拟电路时钟2(也为数字时钟)使能，高使能 */
#define	GT0CLK		(0x04000000 + RCC_PCLK_CR4_GT0_PCE_Pos)	//2/* 计量单元寄存器时钟使能 */
#define	BTCLK			(0x04000000 + RCC_PCLK_CR4_BT_PCE_Pos)		//0	/* PAE时钟使能，高使能 */						
         
#ifdef __cplusplus
}
#endif

#endif /* __FM33L0XX_RCC_H */



/************************ (C) COPYRIGHT FMSHelectronics *****END OF FILE****/
